Ramla-I/hal_agent/devices/nxp/s32k1xx/svd/s32k142.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>S32_NVIC</name>
      <description>Nested Vectored Interrupt Controller</description>
      <baseAddress>0xE000E100</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE04</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA0</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>DMA1</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>DMA2</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>DMA3</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>DMA4</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>DMA5</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>DMA6</name>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>DMA7</name>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>DMA8</name>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>DMA9</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>DMA10</name>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>DMA11</name>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>DMA12</name>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>DMA13</name>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>DMA14</name>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>DMA15</name>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>DMA_Error</name>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>MCM</name>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>FTFC</name>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>Read_Collision</name>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>LVD_LVW</name>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>FTFC_Fault</name>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>WDOG_EWM</name>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>RCM</name>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>LPI2C0_Master</name>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>LPI2C0_Slave</name>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>LPSPI0</name>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>LPSPI1</name>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>LPUART0_RxTx</name>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>LPUART1_RxTx</name>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>ADC0</name>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>ADC1</name>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>CMP0</name>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>ERM_single_fault</name>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>ERM_double_fault</name>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>RTC</name>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>RTC_Seconds</name>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>LPIT0_Ch0</name>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>LPIT0_Ch1</name>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>LPIT0_Ch2</name>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>LPIT0_Ch3</name>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>PDB0</name>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>SCG</name>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>LPTMR0</name>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>PORTA</name>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>PORTB</name>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>PORTC</name>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>PORTD</name>
        <value>62</value>
      </interrupt>
      <interrupt>
        <name>PORTE</name>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>SWI</name>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>PDB1</name>
        <value>68</value>
      </interrupt>
      <interrupt>
        <name>FLEXIO</name>
        <value>69</value>
      </interrupt>
      <interrupt>
        <name>CAN0_ORed</name>
        <value>78</value>
      </interrupt>
      <interrupt>
        <name>CAN0_Error</name>
        <value>79</value>
      </interrupt>
      <interrupt>
        <name>CAN0_Wake_Up</name>
        <value>80</value>
      </interrupt>
      <interrupt>
        <name>CAN0_ORed_0_15_MB</name>
        <value>81</value>
      </interrupt>
      <interrupt>
        <name>CAN0_ORed_16_31_MB</name>
        <value>82</value>
      </interrupt>
      <interrupt>
        <name>CAN1_ORed</name>
        <value>85</value>
      </interrupt>
      <interrupt>
        <name>CAN1_Error</name>
        <value>86</value>
      </interrupt>
      <interrupt>
        <name>CAN1_ORed_0_15_MB</name>
        <value>88</value>
      </interrupt>
      <interrupt>
        <name>FTM0_Ch0_Ch1</name>
        <value>99</value>
      </interrupt>
      <interrupt>
        <name>FTM0_Ch2_Ch3</name>
        <value>100</value>
      </interrupt>
      <interrupt>
        <name>FTM0_Ch4_Ch5</name>
        <value>101</value>
      </interrupt>
      <interrupt>
        <name>FTM0_Ch6_Ch7</name>
        <value>102</value>
      </interrupt>
      <interrupt>
        <name>FTM0_Fault</name>
        <value>103</value>
      </interrupt>
      <interrupt>
        <name>FTM0_Ovf_Reload</name>
        <value>104</value>
      </interrupt>
      <interrupt>
        <name>FTM1_Ch0_Ch1</name>
        <value>105</value>
      </interrupt>
      <interrupt>
        <name>FTM1_Ch2_Ch3</name>
        <value>106</value>
      </interrupt>
      <interrupt>
        <name>FTM1_Ch4_Ch5</name>
        <value>107</value>
      </interrupt>
      <interrupt>
        <name>FTM1_Ch6_Ch7</name>
        <value>108</value>
      </interrupt>
      <interrupt>
        <name>FTM1_Fault</name>
        <value>109</value>
      </interrupt>
      <interrupt>
        <name>FTM1_Ovf_Reload</name>
        <value>110</value>
      </interrupt>
      <interrupt>
        <name>FTM2_Ch0_Ch1</name>
        <value>111</value>
      </interrupt>
      <interrupt>
        <name>FTM2_Ch2_Ch3</name>
        <value>112</value>
      </interrupt>
      <interrupt>
        <name>FTM2_Ch4_Ch5</name>
        <value>113</value>
      </interrupt>
      <interrupt>
        <name>FTM2_Ch6_Ch7</name>
        <value>114</value>
      </interrupt>
      <interrupt>
        <name>FTM2_Fault</name>
        <value>115</value>
      </interrupt>
      <interrupt>
        <name>FTM2_Ovf_Reload</name>
        <value>116</value>
      </interrupt>
      <interrupt>
        <name>FTM3_Ch0_Ch1</name>
        <value>117</value>
      </interrupt>
      <interrupt>
        <name>FTM3_Ch2_Ch3</name>
        <value>118</value>
      </interrupt>
      <interrupt>
        <name>FTM3_Ch4_Ch5</name>
        <value>119</value>
      </interrupt>
      <interrupt>
        <name>FTM3_Ch6_Ch7</name>
        <value>120</value>
      </interrupt>
      <interrupt>
        <name>FTM3_Fault</name>
        <value>121</value>
      </interrupt>
      <interrupt>
        <name>FTM3_Ovf_Reload</name>
        <value>122</value>
      </interrupt>
      <registers>
        <register>
          <name>NVICISER0</name>
          <description>Interrupt Set Enable Register n</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA</name>
              <description>Interrupt set enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISER1</name>
          <description>Interrupt Set Enable Register n</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA</name>
              <description>Interrupt set enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISER2</name>
          <description>Interrupt Set Enable Register n</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA</name>
              <description>Interrupt set enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISER3</name>
          <description>Interrupt Set Enable Register n</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA</name>
              <description>Interrupt set enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISER4</name>
          <description>Interrupt Set Enable Register n</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA</name>
              <description>Interrupt set enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISER5</name>
          <description>Interrupt Set Enable Register n</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA</name>
              <description>Interrupt set enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISER6</name>
          <description>Interrupt Set Enable Register n</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA</name>
              <description>Interrupt set enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISER7</name>
          <description>Interrupt Set Enable Register n</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA</name>
              <description>Interrupt set enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICICER0</name>
          <description>Interrupt Clear Enable Register n</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRENA</name>
              <description>Interrupt clear-enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICICER1</name>
          <description>Interrupt Clear Enable Register n</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRENA</name>
              <description>Interrupt clear-enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICICER2</name>
          <description>Interrupt Clear Enable Register n</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRENA</name>
              <description>Interrupt clear-enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICICER3</name>
          <description>Interrupt Clear Enable Register n</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRENA</name>
              <description>Interrupt clear-enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICICER4</name>
          <description>Interrupt Clear Enable Register n</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRENA</name>
              <description>Interrupt clear-enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICICER5</name>
          <description>Interrupt Clear Enable Register n</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRENA</name>
              <description>Interrupt clear-enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICICER6</name>
          <description>Interrupt Clear Enable Register n</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRENA</name>
              <description>Interrupt clear-enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICICER7</name>
          <description>Interrupt Clear Enable Register n</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRENA</name>
              <description>Interrupt clear-enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISPR0</name>
          <description>Interrupt Set Pending Register n</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETPEND</name>
              <description>Interrupt set-pending bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISPR1</name>
          <description>Interrupt Set Pending Register n</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETPEND</name>
              <description>Interrupt set-pending bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISPR2</name>
          <description>Interrupt Set Pending Register n</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETPEND</name>
              <description>Interrupt set-pending bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISPR3</name>
          <description>Interrupt Set Pending Register n</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETPEND</name>
              <description>Interrupt set-pending bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISPR4</name>
          <description>Interrupt Set Pending Register n</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETPEND</name>
              <description>Interrupt set-pending bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISPR5</name>
          <description>Interrupt Set Pending Register n</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETPEND</name>
              <description>Interrupt set-pending bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISPR6</name>
          <description>Interrupt Set Pending Register n</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETPEND</name>
              <description>Interrupt set-pending bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
